# -*- coding: utf-8 -*-
"""Untitled8.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1p-sIKkVHjOjcf2C6i7PgyuBq-rCROfbq
"""

# Пользователь вводит время в секундах. Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс. Используйте форматирование строк.
 import math
 time = int(input('введите время в секундах: '))
 hours = math.floor(time/3600)
 min = math.floor((time - hours*3600)/60)
 sec = time - hours * 3600 - min * 60
 print (hours,':',min,':',sec)



# Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn. Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.
num = int(input('Напиши свое число: '))
num1 = str(num)*2
num2 = str(num)*3
second = int(num1)
third = int(num2)
sum = num + second + third
sum



# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров. 
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.

print("Введите первый день")
x = int(input())
print("Введите второй день")
y = int(input())
s = x
k = 1
while s <= y:
    k = k+1
    s = 1.1*s
print("k = ", k, end = '')



# Пользователь вводит целое положительное число. Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операции.
# Запросите у пользователя значения выручки и издержек фирмы. 
# Определите, с каким финансовым результатом работает фирма (прибыль — выручка больше издержек, или убыток — издержки больше выручки).
# Выведите соответствующее сообщение. Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке). 
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

print("Введите значение выручки")
x = int(input())
print("Введите значение издержек")
y = int(input())
if x>y: 
  print('прибыль')
  z = (x-y)/x
  print('рентабельность выручки равна ',z)
  print("Введите количество сотрудников")
  m = int(input()) 
  i = (x-y)/m 
  print('Прибыль на одного сотрудника', i)
if x<y:
   print('убыток')

